# __Ayudant칤a 3 - Tidy Data__

In [1]:
import pandas as pd

## __游닇 Apuntes Importantes__

__(Extra칤dos desde el _starter pack_)__

### __1) Lectura de XLSXs__
_(3-Resumen Pandas; Cap 1.3 (B))_

In [ ]:
# Leer un archivo Excel
df = pd.read_excel('output.xlsx', index_col='Unnamed: 0', sheet_name=0)
df

- Par치metros de utilidad: 
    - ```sep=;``` : Para cambiar el separador (muy 칰til para algunos csv en espa침ol)
    - ```index_col='col1'``` : Indicar si existe una columna indice (por defecto se crea una)
    - ```header=2``` : Indicar la fila donde est치n los t칤tulos (por defecto es la primera / se puede agregar None para indicar que no tiene)
    - ```usecols=[col1, col2, ...]``` : Especificar columnas de entrada (en caso de excel puede utilizarse seg칰n las columnas de excel, por ejemplo 'A:D')
    - ```nrows=1000``` : Especificar cantidad de filas de entrada
    - ```sheet_name='hoja1'``` : Especifica la hoja a leerse (Puede indicarse por nombre, por 칤ndice o una lista d ehojas)
    - ```skiprows=2``` : Indica una cantidad de filas para saltar (Si es que no contienen info 칰til)

### __2) Uniendo DataFrames__
_(3-Resumen Pandas; Cap 4)_

#### __2.1- Concatenaci칩n__

La concatenaci칩n refiere a la acci칩n de insertar los datos bruzcamente sobre, bajo o al lado de una tabla desde otra.

In [6]:
# data de ejemplo 1
df1 = pd.DataFrame({'Nombre':['Alonso','Esteban','Pablo','Rodrigo'],'Ingreso':[1200,300,1500,600]})
df1

    Nombre  Ingreso
0   Alonso     1200
1  Esteban      300
2    Pablo     1500
3  Rodrigo      600

In [7]:
# data de ejemplo 2
df2 = pd.DataFrame({'Nombre':['Alonso','Esteban','Pablo','Rodrigo','Patricio'],'Ciudad':['San Pedro','Concepci칩n','Concepci칩n','Talcahuano','San Pedro']})
df2

     Nombre      Ciudad
0    Alonso   San Pedro
1   Esteban  Concepci칩n
2     Pablo  Concepci칩n
3   Rodrigo  Talcahuano
4  Patricio   San Pedro

In [8]:
pd.concat([df1, df2]) # pone uno sobbajore el otro y no agrega datos si la columna no existe

     Nombre  Ingreso      Ciudad
0    Alonso   1200.0         NaN
1   Esteban    300.0         NaN
2     Pablo   1500.0         NaN
3   Rodrigo    600.0         NaN
0    Alonso      NaN   San Pedro
1   Esteban      NaN  Concepci칩n
2     Pablo      NaN  Concepci칩n
3   Rodrigo      NaN  Talcahuano
4  Patricio      NaN   San Pedro

In [9]:
pd.concat([df1, df2], axis=1) # Al cambiar el eje, agrega de manera bruzca una tabla al lado de la otra

    Nombre  Ingreso    Nombre      Ciudad
0   Alonso   1200.0    Alonso   San Pedro
1  Esteban    300.0   Esteban  Concepci칩n
2    Pablo   1500.0     Pablo  Concepci칩n
3  Rodrigo    600.0   Rodrigo  Talcahuano
4      NaN      NaN  Patricio   San Pedro

#### __2.2- Fusi칩n__

El `merge` es una fusi칩n compleja y m치s intelgente que une las tablas a partir de cierta(s) columna(s) en com칰n y por alg칰n m칠todo de uni칩n.

In [10]:
# Unir DataFrames por una columna
df_merged = pd.merge(df1, df2, on='Nombre', how='inner') # tiene parametros: on='columna' y how='inner' | 'outer' | 'left' | 'right' | 'cross'
df_merged # Los une en un mismo dataframe

    Nombre  Ingreso      Ciudad
0   Alonso     1200   San Pedro
1  Esteban      300  Concepci칩n
2    Pablo     1500  Concepci칩n
3  Rodrigo      600  Talcahuano

### __3) Tidy Data__
_(3-Resumen Pandas; Cap 5)_

En este formato, los datos siguen tres principios clave:
1. **Cada variable se almacena en una columna**: Cada atributo o caracter칤stica de los datos es una columna diferente. Por ejemplo, si est치s trabajando con un conjunto de datos sobre ventas, podr칤as tener columnas como "Producto", "Fecha", "Cantidad", "Precio", etc.
2. **Cada observaci칩n est치 en una fila**: Cada fila representa una 칰nica observaci칩n o entrada. Por ejemplo, una fila podr칤a representar una transacci칩n o una venta espec칤fica de un producto en un d칤a determinado.
3. **Cada tipo de unidad de observaci칩n tiene su propio archivo o tabla**: Si tienes m칰ltiples tipos de datos relacionados (como datos de clientes y datos de ventas), cada tipo de entidad se almacena en su propio conjunto de datos. Por ejemplo, podr칤as tener una tabla para clientes y otra para ventas.

Veamos un ejemplo:

In [2]:
data = {
    'Estudiante': ['Ana', 'Luis', 'Mar칤a'],
    'Matem치ticas_2021': [85, 78, 92],
    'Historia_2021': [88, 74, 85],
    'Ciencias_2021': [90, 80, 88],
    'Matem치ticas_2022': [89, 82, 95],
    'Historia_2022': [90, 77, 91],
    'Ciencias_2022': [92, 84, 94],
}

df_no_tidy = pd.DataFrame(data)
df_no_tidy

,Estudiante,Matem치ticas_2021,Historia_2021,Ciencias_2021,Matem치ticas_2022,Historia_2022,Ciencias_2022
0,Ana,85,88,90,89,90,92
1,Luis,78,74,80,82,77,84
2,Mar칤a,92,85,88,95,91,94

- Estos datos no cumplen con las condiciones de un formato tidy, por lo que para un mejor manejo deber치 ser modificada la tabla.

### __5.1- Funci칩n Melt__

La funci칩n `melt` permite traspasar una tabla de formato desordenado a uno _tidy_ de manera sencilla indicando cu치les son la variable de observaci칩n, como se llamar치 la nueva variable y qu칠 valor se medir치.

In [3]:
# Reordenandolo: MELT
df_tidy = df_no_tidy.melt(id_vars=['Estudiante'], var_name='Asignatura', value_name='nota')
df_tidy

   Estudiante        Asignatura  nota
0         Ana  Matem치ticas_2021    85
1        Luis  Matem치ticas_2021    78
2       Mar칤a  Matem치ticas_2021    92
3         Ana     Historia_2021    88
4        Luis     Historia_2021    74
5       Mar칤a     Historia_2021    85
6         Ana     Ciencias_2021    90
7        Luis     Ciencias_2021    80
8       Mar칤a     Ciencias_2021    88
9         Ana  Matem치ticas_2022    89
10       Luis  Matem치ticas_2022    82
11      Mar칤a  Matem치ticas_2022    95
12        Ana     Historia_2022    90
13       Luis     Historia_2022    77
14      Mar칤a     Historia_2022    91
15        Ana     Ciencias_2022    92
16       Luis     Ciencias_2022    84
17      Mar칤a     Ciencias_2022    94

In [4]:
# m치s bonito 
df_tidy2 = df_tidy.copy()
df_tidy2[['Asignatura', 'A침o']] = df_tidy['Asignatura'].str.split('_', expand=True) # parametro expand permite dividirse en columnas
df_tidy2 = df_tidy2[['Estudiante','A침o','Asignatura','nota']] # Nuevo 칩rden
df_tidy2 = df_tidy2.rename(columns={'nota': 'Nota'}) # Nuevo nombre
df_tidy2

   Estudiante   A침o   Asignatura  Nota
0         Ana  2021  Matem치ticas    85
1        Luis  2021  Matem치ticas    78
2       Mar칤a  2021  Matem치ticas    92
3         Ana  2021     Historia    88
4        Luis  2021     Historia    74
5       Mar칤a  2021     Historia    85
6         Ana  2021     Ciencias    90
7        Luis  2021     Ciencias    80
8       Mar칤a  2021     Ciencias    88
9         Ana  2022  Matem치ticas    89
10       Luis  2022  Matem치ticas    82
11      Mar칤a  2022  Matem치ticas    95
12        Ana  2022     Historia    90
13       Luis  2022     Historia    77
14      Mar칤a  2022     Historia    91
15        Ana  2022     Ciencias    92
16       Luis  2022     Ciencias    84
17      Mar칤a  2022     Ciencias    94

### __5.2- Funci칩n Pivot__

Funci칩n contraria al `melt`.

In [5]:
# Proceso contrario: PIVOT
df_no_tidy = df_tidy.pivot(index='Estudiante',columns=['Asignatura'],values='nota').reset_index()
df_no_tidy

Asignatura,Estudiante,Ciencias_2021,Ciencias_2022,Historia_2021,Historia_2022,Matem치ticas_2021,Matem치ticas_2022
0,Ana,90,92,88,90,85,89
1,Luis,80,84,74,77,78,82
2,Mar칤a,88,94,85,91,92,95

## __Workshop 2__:

### Estad칤sticas reportadas por el Banco Mundial por pa칤s
- **PIB Per C치pita**: [https://data.worldbank.org/indicator/NY.GDP.PCAP.CD](https://data.worldbank.org/indicator/NY.GDP.PCAP.CD)
- **Poblaci칩n**: [https://data.worldbank.org/indicator/SP.POP.TOTL](https://data.worldbank.org/indicator/SP.POP.TOTL)
- **칈ndice de Gini**: [https://data.worldbank.org/indicator/SI.POV.GINI](https://data.worldbank.org/indicator/SI.POV.GINI)

### Actividades

1. Descargue los archivos generados por el Banco Mundial en formato Excel. Luego, abra los archivos usando `read_excel()` y especificando que la primera fila corresponda a la que contenga el nombre de las variables. Use el par치metro `header`.

In [ ]:
# Tu c칩digo aqu칤

2. Convierta a formato *tidy* cada conjunto de datos. Realice esta labor por separado.

In [ ]:
# Tu c칩digo aqu칤

3. Calcule la media y mediana de poblaci칩n anualmente.

In [ ]:
# Tu c칩digo aqu칤

4. 쮺칩mo se obtiene el pa칤s con mayor poblaci칩n?

In [ ]:
# Tu c칩digo aqu칤

5. 쮺칩mo se obtiene el pa칤s con menor desigualdad?

In [ ]:
# Tu c칩digo aqu칤

6. Calcule el promedio (media m칩vil) de PIB Per C치pita por pa칤s de los 칰ltimos 5 a침os.

In [ ]:
# Tu c칩digo aqu칤

7. Concatene ambos conjuntos de datos en un 칰nico DataFrame. Use `.concat()`.

In [ ]:
# Tu c칩digo aqu칤

8. Combine ambos conjuntos de datos en un 칰nico DataFrame. Use `.merge()`.

In [ ]:
# Tu c칩digo aqu칤

9. Luego de realizar los ejercicios anteriores, 쮺u치les son las ventajas y desventajas de usar `concat` y `merge`?

In [ ]:
# Tu c칩digo aqu칤

10. Calcule los pa칤ses que tuvieron mayor variaci칩n en su 칤ndice de Gini.

In [ ]:
# Tu c칩digo aqu칤

11. A partir del PIB Per C치pita y la Poblaci칩n, obtenga una nueva columna para medir el PIB.

In [ ]:
# Tu c칩digo aqu칤

12. Calcule la tasa de crecimiento poblacional anual por pa칤s como una nueva columna de datos.

In [ ]:
# Tu c칩digo aqu칤

13. 쮺u치l es la tasa de crecimiento poblacional anual para Chile y Argentina?

In [ ]:
# Tu c칩digo aqu칤

14. Al a침o 2000, determine cu치les son los 10 pa칤ses con mayor PIB Per C치pita y los 10 con mayor poblaci칩n. 쯉on los mismos pa칤ses al 2020?

In [ ]:
# Tu c칩digo aqu칤

15. Al a침o 2020, 쮺u치les son los pa칤ses con mayor nivel de desigualdad, y que, al mismo tiempo, tengan una poblaci칩n menor a 40 millones de habitantes?

In [ ]:
# Tu c칩digo aqu칤